InformationRegisters/СинхронизацияСчетовНаОплату_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СинхронизацияСчетовНаОплату_ат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НавигационнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СинхронизацияСчетовНаОплату_ат/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИБ = Константы.БухгалтерияДляСинхронизации_ат.Получить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НавигационнаяСсылкаПриИзменении(Элемент)
	
	Запись.Идентификатор = Неопределено;
	ОчиститьДанные();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Синхронизировать(Команда)
	
	Если НЕ ОбязательныеРеквизитыЗаполнены() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Запись.НавигационнаяСсылка) Тогда
		
		ПоказатьПредупреждение(, "Навигационная ссылка не заполнена!", 5);
		
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("ПослеВопроса", ЭтаФорма);
		ПоказатьВопрос(Оповещение, "Счёт на оплату в выбранной ИБ Бухгалтерии Предприятия <" + ИБ + "> будет изменён. Продолжить?",
			РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовый(Команда)
	
	Если НЕ ОбязательныеРеквизитыЗаполнены() Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВопроса", ЭтаФорма, "");
	ПоказатьВопрос(Оповещение, "В выбранной ИБ Бухгалтерии Предприятия <" + ИБ + "> будет создан новый Счёт на оплату покупателю. Продолжить?",
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция   ОбязательныеРеквизитыЗаполнены()
	
	ТекстПредупреждения = "";
	
	Если Запись.Ссылка.Пустая() Тогда
		ТекстПредупреждения = "Счёт должен быть выбран!";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстПредупреждения) Тогда
		ПоказатьПредупреждение(, СокрЛ(ТекстПредупреждения), 5);
	КонецЕсли;
	
	Возврат ТекстПредупреждения = "";
	
КонецФункции

&НаКлиенте
Процедура ПослеВопроса(Результат, Идентификатор) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПредупреждения = СинхронизироватьСчет(Идентификатор);
	
	Если ЗначениеЗаполнено(ТекстПредупреждения) Тогда
		ПоказатьПредупреждение(, СокрЛП(ТекстПредупреждения), 5);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   СинхронизироватьСчет(Идентификатор)
	
	ТекстПредупреждения = "";
	
	Если Идентификатор = "" Тогда
		
		Подключение = ПодключениеКИБ_ат.УстановитьПодключение(ИБ);
		Если ТипЗнч(Подключение) = Тип("Строка") Тогда
			Возврат Подключение;
		КонецЕсли;
		
		СинхронизированныйСчет = ПодключениеКИБ_ат.ПолучитьВнешнююСсылкуПоНавигационнойСсылке(Подключение, Запись.НавигационнаяСсылка);
		Если СинхронизированныйСчет = Неопределено Тогда
			Возврат "Введённая навигационная ссылка не корректна для выбранной ИБ Бухгалтерии Предприятия <" + ИБ + ">!";
		КонецЕсли;
		
		Идентификатор = Строки_КлиентСервер_ат.ПолучитьСтрУИдПоНавСсылке(Запись.НавигационнаяСсылка);
		
	КонецЕсли;
	
	РезультатСинхронизации = СинхронизацияСБП_ат.СинхронизироватьСчетНаОплату(Запись.Ссылка, ИБ, Идентификатор);
	Если РезультатСинхронизации.Ошибки.Количество() > 0 Тогда
		
		Для каждого Ошибка Из РезультатСинхронизации.Ошибки Цикл
			ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + Ошибка;
		КонецЦикла;
		
	Иначе
		
		Запись.НавигационнаяСсылка 	= РезультатСинхронизации.НавигационнаяСсылка;
		Запись.Идентификатор 		= РезультатСинхронизации.Идентификатор;
		Запись.ДатаСчета 			= РезультатСинхронизации.ДатаДокумента;
		Запись.НомерСчета 			= РезультатСинхронизации.НомерДокумента;
		Запись.СуммаСчета 			= РезультатСинхронизации.СуммаДокумента;
		
		Попытка
			
			Записать();
			
			ТекстПредупреждения = "Синхронизация прошла успешно";
			
		Исключение
			
			ТекстПредупреждения = ОписаниеОшибки();
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ТекстПредупреждения;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьДанные()
	
	Запись.ДатаСчета  = Неопределено;
	Запись.НомерСчета = Неопределено;
	Запись.СуммаСчета = Неопределено;
	
КонецПроцедуры

#КонецОбласти
